app/views/users/_userstats.html.erb

    <td><%= user.weight %></td>
    <td><%= user.meals.count %></td>
---
SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = ?  [["user_id", 4]]
SELECT COUNT(*) FROM "meals" WHERE "meals"."user_id" = ?  [["user_id", 2]]