app/views/users/_users.html.erb

      <td><%= user.weight %></td>
      <td><%= user.meals.count %></td>
---
SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = ?  [["user_id", 5]]
SELECT COUNT(*) FROM "meals" WHERE "meals"."user_id" = ?  [["user_id", 5]]