app/views/meals/_form.html.erb

        <%= meal_builder.date_select :mealdate %><br>
      <div class="field<%= '_with_errors' if meal_builder.object.errors[:food].any? %>">
---
SELECT "foods".* FROM "foods" ORDER BY name