app/views/meals/edit.html.erb

SELECT "foods".* FROM "foods" ORDER BY name
---
  </div>
  <div class="field<%= '_with_errors' if f.object.errors[:new_food].any? %>">