app/views/foods/_foods.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
      <td><%= link_to food.name, food_path(food) %></td>
      <td><%= link_to food.group.name, group_path(food.group) %></td>