app/views/foods/_food.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
Name: <%= link_to @food.name, food_path(@food) %><br>
Group: <%= link_to @food.group.name, group_path(@food.group) %><br>