app/views/foods/_form.html.erb


<div class="field<%= ' field_with_errors' if food.errors[:group].any? %>">
---
SELECT "groups".* FROM "groups" ORDER BY name