app/controllers/foods_controller.rb

  def destroy
    if @food.delete
---
DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 62]]

    def set_food
      @food = Food.find_by_id(params[:id])
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 66], ["LIMIT", 1]]