app/controllers/groups_controller.rb

    def set_group
      @group = Group.find_by_id(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]