app/controllers/meals_controller.rb

SELECT "meals".* FROM "meals"
---
  def index
    if current_user.admin?
      @meals = Meal.all.sort_by {|m| [m.created_at, m.mealname_id]}

UPDATE "meals" SET "food_id" = ?, "note" = ?, "updated_at" = ? WHERE "meals"."id" = ?  [["food_id", 43], ["note", "yah mon, was ganja before"], ["updated_at", 2017-02-06 15:05:11 UTC], ["id", 56]]
---
  def update
    @meal.update(meal_params)

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = ? LIMIT ?  [["id", 56], ["LIMIT", 1]]
---
    def set_meal
      @meal = Meal.find_by_id(params[:id])