app/controllers/quotes_controller.rb

    def index
      @quotes = Quote.all
---
SELECT "quotes".* FROM "quotes"

    def create
      @quote = Quote.build_quote_params(params)
      # @quote = Quote.new(quote_params)
      if @quote.save
---
INSERT INTO "quotes" ("phrase_id", "celeb_id", "verb_id", "food_id", "adj_id", "diet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["phrase_id", 6], ["celeb_id", 18], ["verb_id", 3], ["food_id", 5], ["adj_id", 5], ["diet_id", 8], ["created_at", 2017-02-08 19:10:46 UTC], ["updated_at", 2017-02-08 19:10:46 UTC]]

    def destroy
      if @quote.delete
---
DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 1]]

      def set_quote
        @quote = Quote.find_by_id(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]