app/controllers/users_controller.rb

SELECT COUNT(*) FROM "meals" WHERE "meals"."user_id" = ?  [["user_id", 2]]
---
  def show
    @user = current_user unless current_user.admin?
    @meals_count = @user.meals.count

UPDATE "users" SET "encrypted_password" = ?, "weight" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$11$03dEADOtkjjF/Hd.MAGcduldolld6T4Kdd.qOzUjedDGAOZ1Ugafe"], ["weight", 194], ["updated_at", 2017-02-08 00:35:48 UTC], ["id", 9]]
---
  def update
    @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by_id(params[:id])